<?xml version="1.0" encoding="utf-8"?>
<policy>
    <general>
        <name>%POLICY_NAME%</name>
        <enabled>true</enabled>
        <frequency>Once per computer</frequency>
        <trigger_checkin>true</trigger_checkin>
        <trigger_enrollment_complete>true</trigger_enrollment_complete>
         <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
      <site>
        <name>None</name>
      </site>
    </general>
    <scope>
      <all_computers>true</all_computers>
    </scope>
    <package_configuration>
        <packages>
            <size>1</size>
            <package>
                <name>%pkg_name%</name>
                <action>Install</action>
            </package>
        </packages>
    </package_configuration>
    <scripts>
        <size>0</size>
    </scripts>
    <self_service>
        <use_for_self_service>false</use_for_self_service>
    </self_service>
</policy>